{
	"data": [
		{ 
			"id": 1,
			"type": "present",
			"name": "Present Simple",
			"whenToUse": [
				"Repeated actions or routine",
				"Facts or instructions"
			],
			"rules": [
				"In the third person singular, the verb always ends in '-s'",
				"For negative and interrogative forms, use 'does/do'",
				"Add '-es' if verb finish with: -ss, -x, -sh, -ch"
			],
			"examples": [
				"I work in London",
				"Your exam starts at 09:00",
				"She does not run so fast",
				"We catch the bus every morning",
				"You walk for two hundred meters, then you turn left",
				"New York is a large city",
				"Water freezes at zero degrees",
				"His mother arrives tomorrow",
				"He goes to school every morning",
				"She enjoys playing the piano",
				"We do not think about that",
				"He drinks a lot on parties",
				"Open your books at page 34"
			]
		},
	  	{ 
			"id": 2,
			"type": "present",
			"name": "Present Continuous",
			"whenToUse": [
				"Action not finished or incompleted",
				"Actions happening at the moment of speaking"
			],
			"rules": [
				"Verb to be (am/are/is) + infinitive + -ing"
			],
			"examples": [
				"We are going to the beach",
				"More and more people are becoming vegetarian",
				"Are you still working for the same company?",
				"I am not going to my home",
				"Are you going to the office?",
				"He usually plays the drums",
				"He is not playing football"
			]
		},
	  	{ 
			"id": 3,
			"type": "present",
			"name": "Present Perfect",
			"whenToUse": [
				"When the precise time of action is not important or not know",
				"An action or situation that started in the past and continues in the present"
			],
			"rules": [
				"Have/has + irregular verb: third column of irregular verbs",
				"Have/has + regular verb: infinitive + ed"
			],
			"examples": [
				"I have never fallen down the stairs",
				"I have lived in Barcelona since 1982",
				"Have you played the piano since you were a child?",
				"We have visited Portugal several times",
				"We have had the same car for ten years",
				"It has happened several times already",
				"Someone has eaten my soup!",
				"I've worked here for six months",
				"I haven't gone to the cinema for a long time",
				"I have just finished my work",
				"He has read that book",
				"I have just eaten",
				"Has he just left?",
				"I have been to London recently"
			]
		},
		{ 
			"id": 4,
			"type": "present",
			"name": "Present Perfect Continuous",
			"whenToUse": [
				"Emphasis on duration"
			],
			"rules": [
				"Have/has + been + infinitive + -ing"
			],
			"examples": [
				"Has she been running?",
				"Someone's been eating my chips",
				"I've heard a lot about you recently",
				"They have been travelling since last October",
				"She has been cooking since last night",
				"I have been waiting for you for three hours",
				"He has not been playing handball",
				"Have you been playing football?"
			]
		},
		{ 
			"id": 5,
			"type": "past",
			"name": "Past Simple",
			"whenToUse": [
				"Actions finished in the past",
				"Actions finished at specific time"
			],
			"rules": [
				"Regular verb: infinitive + -ed",
				"Irregular verb: Second column of irregular verbs",
				"Use did + infinitive verb in negative or question forms"
			],
			"examples": [
				"I went to school",
				"He cleaned his room",
				"She didn't clean the room",
				"Did you play football?",
				"The keys weren’t in the drawer",
				"We didn’t believe him",
				"I worked for many years in a museum",
				"Did Jack win the gold medal?"
			]
		},
		{ 
			"id": 6,
			"type": "past",
			"name": "Past Continuous",
			"whenToUse": [
				"Ongoing past action"
			],
			"rules": [
				"verb to be (was, were) + infinitive + -ing"
			],
			"examples": [
				"I was playing with my best friend",
				"You were not driving the car",
				"Was he writting the letter?",
				"He was playing the guitar",
				"Anne was writing a letter while Steve was reading the New York Times",
				"He was going to the mountain when he fell",
				"He was tired because he was exercising so hard"
			]
		},
		{ 
			"id": 7,
			"type": "past",
			"name": "Past Perfect",
			"whenToUse": [
				"Two finished actions"
			],
			"rules": [
				"Had + irregular verb: third column of irregular verbs",
				"Had + regular verb: infinitive + ed"
			],
			"examples": [
				"Maria had known about it for a while",
				"I had already gone to my home when she arrived",
				"I had not eaten at that restaurant before today",
				"Had Adam ever spoken to the CEO before he was fired?",
				"My friends had never gone to the USA",
				"Why had he agreed to work for that salary?",
				"Anthony had met Ryan before you introduced him to us at the party",
				"He had never played football until last week",
				"I had fallen asleep before eight o'clock",
				"The teacher asked if we had studied for the exam",
				"I had just gone outside when it started to rain",
				"I had been to Mexico once before"
			]
		},
		{ 
			"id": 8,
			"type": "past",
			"name": "Past Perfect Continuous",
			"whenToUse": [
				"Action had been happening before something else happened",
				"Emphasizes a duration of time before something in the past"
			],
			"rules": [
				"Had + been + infinitive + -ing"
			],
			"examples": [
				"We had been waiting for ages before the bus finally arrived",
				"Betty failed the final test because she had not been attending class",
				"She looked tired because she had been exercicing",
				"I had been waiting for Susan for 2 hours when she arrived",
				"How long had you been waiting to get on the bus?",
				"James had been teaching at the university for more than a year before he left for Asia",
				"How long had you been studying Turkish before you moved to Ankara?",
				"You had only been waiting there for a few minutes when he arrived"
			]
		},
		{ 
			"id": 9,
			"type": "future",
			"name": "Future Simple",
			"whenToUse": [
				"Plans",
				"Predictions",
				"Request that someone help us",
				"To express a promise"
			],
			"rules": [
				"Will + verb",
				"Be going to + verb"
			],
			"examples": [
				"I will help you in a few minutes",
				"She is going to the beach tomorrow",
				"Are you going to meet Jane tonight?",
				"Will you help me later?",
				"I will send you the information when I get it",
				"Will you help me move this heavy table?",
				"I won't do all the housework myself!",
				"He will not does your homework for you",
				"I will call you when I arrive",
				"Don't worry, I'll be careful",
				"I won't tell anyone your secret",
				"He will surely fall down the stairs next time"
			]
		},
		{ 
			"id": 10,
			"type": "future",
			"name": "Future Continuous",
			"whenToUse": [
				"Ongoing future action",
				"Parallel actions in the future"
			],
			"rules": [
				"Will be/be going to be + verb + -ing"
			],
			"examples": [
				"I will be waiting for her when her plane arrives tonight",
				"Will you be waiting for her when her plane arrives tonight?",
				"He will be studying at the library tonight",
				"Are you going to be waiting for her when her plane arrives tonight?",
				"At midnight tonight, we will still be driving through the desert",
				"Tonight at 8 PM, I am going to be eating dinner",
				"Tonight, they will be eating dinner, discussing their plans, and having a good time",
				"At 8:00 PM tonight, the dishes are going to be being washed by John"
			]
		},
		{ 
			"id": 11,
			"type": "future",
			"name": "Future Perfect",
			"whenToUse": [
				"Two future actions"
			],
			"rules": [
				"Will/to be (am/are/is) going to + have + irregular verb: third column of irregular verbs",
				"Will/to be (am/are/is) going to + have + regular verb: infinitive + ed"
			],
			"examples": [
				"She will have gone by the time he arrives",
				"I will have written the letter by tomorrow",
				"Will she have learned enough Chinese to communicate before she moves to Beijing?",
				"By next November, I will have received my promotion",
				"I am not going to have finished this test by 3 o'clock",
				"By the time I finish this course, I will have taken ten tests",
				"I will have been in London for six months by the time I leave",
				"By Monday, Susan is going to have had my book for a month",
				"They will have completed the project before the deadline",
				"They are going to have completed the project before the deadline"
			]
		},
		{ 
			"id": 12,
			"type": "future",
			"name": "Future Perfect Continuous",
			"whenToUse": [
				"To show that something will continue up until a particular event or time in the future"
			],
			"rules": [
				"Will/to be (am/are/is) going to have been + infinitive + -ing"
			],
			"examples": [
				"I will have been swimming for an hour by 6:30",
				"You will not have been waiting for more than two hours when her plane finally arrives",
				"Are you going to have been waiting for more than two hours when her plane finally arrives?",
				"She is going to have been working at that company for three years when it finally closes",
				"How long will you have been studying when you graduate?",
				"You won't get a promotion until you have been working here as long as Tim",
				"The artist will have been painting the mural for over six months by the time it is finished",
				"The song is going to have been being played by the musician for over seven minutes by the time it is finished"
			]
		}
	]
}